rottenpotatoes/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "New Movie"], ["director", "Zijian Zhang"], ["created_at", "2022-10-24 23:07:18.393476"], ["updated_at", "2022-10-24 23:07:18.393476"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "Star Wars"]]
---
  def search
    @movies_with_same_director = Movie.with_same_director(params[:title])
    if @movies_with_same_director == nil
      redirect_to root_url, notice: "'#{params[:title]}' has no director info"
    else
      @movie = Movie.find_by(title:params[:title])